{
    "homeLink": "Início",
    "aboutMeLink": "Sobre",
    "worksLink": "Projetos",
    "contactLink": "Contato",
    "langsDropdownLabel": "Português",
    "myProjectsSecHeader": "Meus <span class=\"highlight\">Projetos</span>",
    "project1Description": "Site portfólio criado para uma firma de arquitetura, com design moderno e totalmente responsivo, comportando dispositivos de diferentes resoluções. O site foi desenvolvido utilizando HTML, Tailwind e JavaScript.",
    "project2Description": "Um aplicativo Full Stack MERN desenvolvido com TypeScript e Reactjs. O backend foi construído seguindo os estilos arquiteturais REST e Microsserviços. Aqui o desafio era usar JSON Web Tokens para lidar com os dados do usuário de forma segura. O processo de desenvolvimento seguiu uma abordagem TDD.",
    "project2Link": {
        "title": "Ir ao repositório desse projeto"
    },
    "project3Description": "Uma REST API desenvolvida para a conclusão do Santander Bootcamp 2023. O objetivo foi simular operações de uma biblioteca, como registrar livros, usuários e emitir empréstimo de livros aos usuários registrados. A API foi desenvolvida na linguagem Java utilizando Spring Framework, e PostgreSQL.",
    "project3Link": {
        "title": "Ir ao repositório desse projeto"
    },
    "project4Description": "Um aplicativo Full Stack, hospedado na nuvem e construído com JavaScript. O objetivo era aplicar o TDD (Desenvolvimento Orientado a Testes) usando Chaijs, Nodejs, Express e MongoDB. A arquitetura de backend foi segue o estilo Microsserviços, visando autonomia dos serviços e melhor escalabilidade.",
    "project4Link": {
        "title": "Ir ao repositório desse projeto"
    },
    "project5Description": "Aplicação Web Fullstack, desenvolvida com Vue e Nestjs, que lê e extrai dados de planilhas com a biblioteca Exceljs, faz o cálculo de indicadores financeiros, e usa gráficos feitos com D3.js para expor as métricas calculadas. A aplicação foi desenvolvida em ambiente docker, e seguindo a prática de TDD.",
    "project5Link": {
        "title": "Ir ao repositório desse projeto"
    },
    "project6Description": "Um projeto Fullstack com Frontend feito em HTML e CSS, e onde o desafio foi desenvolver a arquitetura de Backend seguindo o estilo de Microsserviços e utilizar as operações CRUD.",
    "project6Link": {
        "title": "Ir ao repositório desse projeto"
    }
}